---
kind: property
id: P:Autodesk.Revit.DB.Visual.Speckle.TextureRealWorldOffsetX
source: html/18fa7fce-0524-e25b-3f73-5a13972c832e.htm
---
# Autodesk.Revit.DB.Visual.Speckle.TextureRealWorldOffsetX Property

The property labeled "Offset X" from the "Speckle" schema.

## Syntax (C#)
```csharp
public static string TextureRealWorldOffsetX { get; }
```

## Remarks
This property is of type "AssetPropertyDistance".